Simple Structural Connection Handler cannot connect too far elements
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.420)
 Syntax
  C#
public static FailureDefinitionId SimpleConnectionTooFarRefs { get; }
  Visual Basic
Public Shared ReadOnly Property SimpleConnectionTooFarRefs As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ SimpleConnectionTooFarRefs {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures StructuralCustomConnectionFailures Class
  Autodesk.Revit.DB Namespace